tap "homebrew/bundle"
tap "jesseduffield/lazydocker"
brew "bat"
brew "htop"
brew "ipython"
brew "lazydocker"
brew "neovim"
brew "pdm"
brew "pre-commit"
brew "ruff"
brew "tree"
cask "cabal"
vscode "be5invis.toml"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "mikoz.black-py"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sjhuangx.vscode-scheme"
vscode "svelte.svelte-vscode"
